<template>
    <div class="container">
        <svg
            class="arrow-up"
            width="47"
            height="47"
            viewBox="0 0 47 47"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
        >
            <g filter="url(#filter0_b)">
                <circle
                    r="22.5"
                    transform="matrix(1 0 0 -1 23.5 23.5)"
                    fill="white"
                    fill-opacity="0.9"
                />
                <circle
                    r="22.5"
                    transform="matrix(1 0 0 -1 23.5 23.5)"
                    stroke="black"
                    stroke-opacity="0.05"
                    stroke-width="1.5"
                />
            </g>
            <path
                opacity="0.8"
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M31.8771 25.209L23.7752 17.6002C23.278 17.1333 22.472 17.1333 21.9748 17.6002L13.8729 25.209C13.3757 25.6759 13.3757 26.4329 13.8729 26.8998C14.3701 27.3667 15.1761 27.3667 15.6733 26.8998L22.875 20.1364L30.0767 26.8998C30.5739 27.3667 31.3799 27.3667 31.8771 26.8998C32.3743 26.4329 32.3743 25.6759 31.8771 25.209Z"
                fill="#292941"
            />
            <defs>
                <filter
                    id="filter0_b"
                    x="-4.75"
                    y="-4.75"
                    width="56.5"
                    height="56.5"
                    filterUnits="userSpaceOnUse"
                    color-interpolation-filters="sRGB"
                >
                    <feFlood flood-opacity="0" result="BackgroundImageFix" />
                    <feGaussianBlur in="BackgroundImage" stdDeviation="2.5" />
                    <feComposite in2="SourceAlpha" operator="in" result="effect1_backgroundBlur" />
                    <feBlend
                        mode="normal"
                        in="SourceGraphic"
                        in2="effect1_backgroundBlur"
                        result="shape"
                    />
                </filter>
            </defs>
        </svg>
        <LikeBar />
        <div v-for="item of items" :key="item.id">
            <div class="container-inner">
                <p class="text">
                    {{ item.description }}
                </p>
            </div>
            <div class="img-wrapper">
                <img class="img" src="../../../public/img/NewsOpen1.png" />
            </div>
            <div class="container-inner">
                <h4 class="title">{{ item.title }}</h4>
                <p class="text">
                    {{ item.text }}
                </p>
            </div>
        </div>
    </div>
</template>

<script>
import LikeBar from "../../components/desktop/LikeBar";
const NewsOpen = {
    name: "NewsOpen",
    components: {
        LikeBar,
    },
    data: () => ({
        items: [
            {
                description:
                    "Одно из самых тяжелых испытаний для человека — смерть близкого. Однако родственники героев нашего сегодняшнего материала столкнулись с гораздо более страшной трагедией — их родные пропали без вести, оставив близких в полнейшем неведении относительно их судьбы. Ушла гулять с подругой и не вернулась, пропала из гостиничного номера, исчез по дороге в художественную школу — эти жуткие формулировки стали последними воспоминаниями для тех, чьи родные бесследно исчезли, не оставив никаких следов, улик и тени надежды на то, что они когда-нибудь вернутся домой. Долгие месяцы и даже годы поисков, привлечение сил полиции и волонтеров, отчаянное желание узнать хоть что-то о судьбе своих родных — эти дела о пропавших не сдвинулись с мертвой точки, несмотря на колоссальные усилия всех участников расследования. Однако в сердцах тех,кто ждет их дома, все еще жива надежда на встречу.",
                title: "Николь Морен",
                img: "",
                text:
                    "8-летняя Николь Луиза Морен 30 июля 1985 года находилась в своем доме в Торонто вместе с матерью. Семья жила в престижном районе города Этобико, а их многоквартирный жилой комплекс с бассейном, тренажерным залом, игровыми комнатами и охраняемой территорией считался абсолютно безопасным.",
                id: 0,
            },
            {
                description:
                    "Одно из самых тяжелых испытаний для человека — смерть близкого. Однако родственники героев нашего сегодняшнего материала столкнулись с гораздо более страшной трагедией — их родные пропали без вести, оставив близких в полнейшем неведении относительно их судьбы. Ушла гулять с подругой и не вернулась, пропала из гостиничного номера, исчез по дороге в художественную школу — эти жуткие формулировки стали последними воспоминаниями для тех, чьи родные бесследно исчезли, не оставив никаких следов, улик и тени надежды на то, что они когда-нибудь вернутся домой. Долгие месяцы и даже годы поисков, привлечение сил полиции и волонтеров, отчаянное желание узнать хоть что-то о судьбе своих родных — эти дела о пропавших не сдвинулись с мертвой точки, несмотря на колоссальные усилия всех участников расследования. Однако в сердцах тех,кто ждет их дома, все еще жива надежда на встречу.",
                title: "Николь Морен",
                img: "",
                text:
                    "8-летняя Николь Луиза Морен 30 июля 1985 года находилась в своем доме в Торонто вместе с матерью. Семья жила в престижном районе города Этобико, а их многоквартирный жилой комплекс с бассейном, тренажерным залом, игровыми комнатами и охраняемой территорией считался абсолютно безопасным.",
                id: 1,
            },
            {
                description:
                    "Одно из самых тяжелых испытаний для человека — смерть близкого. Однако родственники героев нашего сегодняшнего материала столкнулись с гораздо более страшной трагедией — их родные пропали без вести, оставив близких в полнейшем неведении относительно их судьбы. Ушла гулять с подругой и не вернулась, пропала из гостиничного номера, исчез по дороге в художественную школу — эти жуткие формулировки стали последними воспоминаниями для тех, чьи родные бесследно исчезли, не оставив никаких следов, улик и тени надежды на то, что они когда-нибудь вернутся домой. Долгие месяцы и даже годы поисков, привлечение сил полиции и волонтеров, отчаянное желание узнать хоть что-то о судьбе своих родных — эти дела о пропавших не сдвинулись с мертвой точки, несмотря на колоссальные усилия всех участников расследования. Однако в сердцах тех,кто ждет их дома, все еще жива надежда на встречу.",
                title: "Николь Морен",
                img: "",
                text:
                    "8-летняя Николь Луиза Морен 30 июля 1985 года находилась в своем доме в Торонто вместе с матерью. Семья жила в престижном районе города Этобико, а их многоквартирный жилой комплекс с бассейном, тренажерным залом, игровыми комнатами и охраняемой территорией считался абсолютно безопасным.",
                id: 2,
            },
        ],
    }),
};
export default NewsOpen;
</script>

<style scoped>
.container {
    padding: 30px 0px 90px 0px;
    position: relative;
}
.arrow-up {
    cursor: pointer;
    position: fixed;
    top: 100px;
    right: 0;
    transform: translateX(-50%);
}
.like-bar {
    position: fixed;
    top: 150px;
    left: 50%;
    transform: translateX(-50%);
    height: 65px;
    width: 330px;
    flex-direction: row;
    background: #ffffff;
    border: 1.5px solid rgba(0, 0, 0, 0.05);
    box-sizing: border-box;
    border-radius: 15px;
}

.container-inner {
    padding: 0px 26px 0px 23px;
}
.img-wrapper {
    margin: 30px 0px;
    display: flex;
    align-items: center;
    justify-content: center;
    max-height: 280px;
}
.img {
    max-width: 100%;
    height: auto;
    object-fit: contain;
}
.title {
    margin-bottom: 15px;
}
.text {
}
</style>
